tutorials/sixDoF_2D/deformMesh/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicMotionSolverFvMesh;

motionSolverLibs    ("libsixDoFRigidBodyMotion.so");

motionSolver        sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
    patches         (floatingObject);
    innerDistance   0.05;
    outerDistance   0.35;

    //centreOfMass    (0.0 0.0 -0.0126);
    centreOfMass    (0.0 0.0 -0.016);

    // Cuboid dimensions
    Lx              0.2;
    Ly              0.2;
    Lz              0.132;

    // Density of the solid
    //rhoSolid        500;

    // Cuboid mass
    mass            3.148; // #eval{ $rhoSolid*$Lx*$Ly*$Lz };

    // Cuboid moment of inertia about the centre of mass
    momentOfInertia ( 0.015 0.015 0.021 );

    report          on;

    accelerationRelaxation 0.8;
    //accelerationDamping   0.95;

    solver
    {
        type Newmark;
    }

    constraints
    {
        // translation contrained on a plane around CoR
        fixedPlane
        {
            sixDoFRigidBodyMotionConstraint plane;
            normal (0 1 0);
        }

        // rotation constraint
        fixedAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis (0 1 0);
        }
    }

    restraints
    {
        moorDynR2
        {
            sixDoFRigidBodyMotionRestraint moorDynR2;
            inputFile                      "Mooring/lines_v2.txt";
            writeMooringVTK                true;
        }

        /* Example mooring restraints as defined in libsixDoFMooring
          moorDynR1 || moorDynR2 || map3R || moodyR

        moorDynR1
        {
            sixDoFRigidBodyMotionRestraint moorDynR1;
        }

        moorDynR2
        {
            sixDoFRigidBodyMotionRestraint moorDynR2;
            inputFile                      "Mooring/lines_v2.txt";
            writeMooringVTK                true;
        }

        moorDynR2_pt
        {
            sixDoFRigidBodyMotionRestraint  moorDynR2;
            couplingMode       "POINT";
            inputFile          "Mooring/lines_v2_point.txt";
            refAttachmentPt
            (
                (-0.1      0.1    -0.077)
                (-0.1     -0.1    -0.077)
                ( 0.1      0.1    -0.077)
                ( 0.1     -0.1    -0.077)
            );
            writeMooringVTK    true;
            vtkPrefix         "mdv2_pt";
            vtkStartTime       0;
            outerCorrector     3;
        }

        moorDynR2_bd
        {
            sixDoFRigidBodyMotionRestraint  moorDynR2;
            couplingMode       "BODY";
            inputFile          "Mooring/lines_v2.txt";
            writeMooringVTK    true;
            vtkPrefix         "mdv2_body";
            vtkStartTime       0;
            outerCorrector     3;
        }

        map3R
        {
            sixDoFRigidBodyMotionRestraint map3R;
            inputFile                     "Mooring/esflOWC_4lines.map";
            summaryFile                   "Mooring/esflOWC_summary.map";
            waterDepth                    0.5;
            refAttachmentPt
            (
                (-0.1      0.1    -0.077)
                (-0.1     -0.1    -0.077)
                ( 0.1      0.1    -0.077)
                ( 0.1     -0.1    -0.077)
            );
            writeMooringForces     true;
            outputFile             "Mooring/mapForces.dat";
            writeMooringVTK        true;
            //nNodes                 10;
            //nodesPerLine           (10 10 10 10);
        }

        moodyR
        {
            sixDoFRigidBodyMotionRestraint moodyR;
            inputFile              "Mooring/boxWu_exPoint.m";
            couplingMode           "externalPoint";  // or "externalRigidBody"
            //If couplingMode is "externalPoint", nCouplingDof = 3*refAttachmentPt.size()
            nCouplingDof           6;
            refAttachmentPt
            (
                (-0.1      0.1    -0.077)
                (-0.1     -0.1    -0.077)
                ( 0.1      0.1    -0.077)
                ( 0.1     -0.1    -0.077)
            );
            waveKinematics         false;
            twoD                   true;
        }
        */
    }
}


// ************************************************************************* //
